## Set Exercises

---
* Given two sets, find their intersection.
* Given two sets, find their union.
* Given a set, check if it is a subset of another set.
* Given a set of numbers, find the maximum value.
* Given a set of strings, find the longest string.
* Given two sets, find their symmetric difference.
* Given a set, remove all even numbers from it.
* Given a set, remove duplicates from it.
* Given two sets, find their difference.
* Given a set, check if it is empty.

#### Given two sets, find their intersection

Sets are mutable unordered collections of unique elements.  
Common uses include membership testing, removing duplicates from a sequence, and computing standard math operations on sets such as intersection, union, difference, and symmetric difference.

In [1]:
# Let create two set
set_one = {1,2,3,4,5}
set_two = {2,3,4,5,6,7}

In [2]:
# Let find the intersection

set_intersection = set_one.intersection(set_two)
print(set_intersection)

{2, 3, 4, 5}

In [3]:
# Union of the set
set_union = set_one.union(set_two)
print(set_union)

{1, 2, 3, 4, 5, 6, 7}

In [4]:
# check if it is a subset of another set.
# The "issubset()" function Returns whether another set contains this set or not
# Let create a new set

set_a = {2,3,4}
set_b = {3,4,5,2,5}

set_subset = set_a.issubset(set_b)
print(set_subset)

True

In [5]:
# Given a set of strings, find the longest string
set_one = {"Apple", "Banana", "PawPaw", "Pineaple"}

# Let use the len() funtion to determine the number  of element in a set

print(len(set_one))
# We use the max function

print(max(set_one))

4
Pineaple

In [6]:
# Given a set of numbers, find the maximum value
set_a = {2,3,4}
print(max(set_a))

4

In [7]:
# Given two sets, find their symmetric difference
# The symmetric_difference() returns set contains a mix of items that are not present in both sets

set_one = {1,10,8,9,4,5}
set_two = {2,3,4,5,6,7}

print(set_one.symmetric_difference(set_two))

{1, 2, 3, 6, 7, 8, 9, 10}

In [8]:
set_one = {1,10,8,12,4}

In [9]:
#Given a set, remove all even numbers from it
new_set = set()
for i in set_one:
    divid = i%2
    if divid !=0:
        new_set.add(i)
print(new_set)

{1}

In [79]:
# Another method of solving example above
new_set = set()
for i in set_one:
    if(i%2!=0):
        new_set.add(i)
print(new_set)

{1}

In [ ]:
# Given a set, remove duplicates from it
set_one = {1,10,11,11,10,10,8,9,4,5}

# Since set does not allow duplicates we create a new set
new_set = set(set_one)
print(new_set)

In [ ]:
# Given two sets, find their difference
set_one = {1,2,3,4,5}
set_two = {2,3,4,5,6,7}
set_one.difference(set_two)

#The returned set contains a mix of items that are not present in both sets

In [ ]:
#Given a set, check if it is empty
set_one = {}
if len(set_one) !=0:
    print("Not empty")
else:
    print("Empty set")

## List Exercises
---

* Given a list, find its length.
* Given a list, find the sum of all its elements.
* Given a list, find the maximum value.
* Given a list, find the minimum value.
* Given a list, find the average value.
* Given a list, find the median value.
* Given a list, find the mode value.
* Given a list, remove all even numbers from it.
* Given a list, sort it in ascending order.
* Given a list, reverse its order.

In [11]:
list_one = ["Ganiu", "Ayo", "Tunde"]
list_one

['Ganiu', 'Ayo', 'Tunde']

In [12]:
#Given a list, find its length.
list_lenght = len(list_one)
print("The length of element in this list is {}".format(list_lenght))

The length of element in this list is 3

In [13]:
#Given a list, find the sum of all its elements.
num_list = [21,34,21,23,45]
sum_list = sum(num_list)
print("The sum of the list is {}".format(sum_list))

The sum of the list is 144

In [14]:
#Given a list, find the average value.
# Since their is no built in average function we add the sum divide by the length
avg_list= sum_list/list_lenght
print("Average of the list is {} ".format(round(avg_list,2)))

Average of the list is 48.0

In [15]:
# Given a list, find the median value.
# To find the median we import statistics library
import statistics as st
list_median = st.median(num_list)
print("The median value = {}".format(list_median))

The median value = 23

In [16]:
# Given a list, find the mode value
list_mode = st.mode(num_list)
print("The mode of the list is {}".format(list_mode))

The mode of the list is 21

In [17]:
# Given a list, remove all even numbers from it.
list_one = [1,3,6,5,6,8]
new_list = list()
for i in list_one:
    divid = i%2
    if (divid !=0):
# Since list is mutable we can use the add function or append it to a new list
        new_list.append(i)
print(new_list)

[1, 3, 5]

In [18]:
#Given a list, sort it in ascending order.
list_one = [1,7,6,5,6,8]
list_one.sort()
print(list_one)

[1, 5, 6, 6, 7, 8]

In [19]:
#Given a list, sort it in descending order.
list_one = [1,7,6,5,6,8]
list_one.sort(reverse=True)
print(list_one)

[8, 7, 6, 6, 5, 1]

**Tuple Exercises**

---
* Given a tuple, find its length.
* Given a tuple, find the maximum value.
* Given a tuple, find the minimum value.
* Given a tuple, find the sum of all its elements.
* Given a tuple, find the average value.
* Given a tuple, find the median value.
* Given a tuple, convert it to a list.
* Given two tuples, concatenate them into a single tuple.
* Given a tuple, reverse its order.
* Given a tuple, check if it contains a specific element.

A tuple is a collection which is ordered and unchangeable. It also allows duplicates  
A tuple can contain different data types

In [20]:
my_tuple = ('Orange','Banana', 'Apple','Mango','Apple', 23, 55.4)
my_tuple

('Orange', 'Banana', 'Apple', 'Mango', 'Apple', 23, 55.4)

In [21]:
#Given a tuple, find its length
tuple_lenght = len(my_tuple)
print("The length of tuple is {}".format(tuple_lenght))

The length of tuple is 7

In [22]:
#Given a tuple, find the maximum value
num_tuple = (2,4,54,88,32,32,11)
max_tuple = max(num_tuple)
print(max_tuple)

88

In [23]:
#Given a tuple, find the minimum value
min_tuple = min(num_tuple)
print(min_tuple)

2

In [24]:
# Given a tuple, find the sum of all its elements
sum_tuple = sum(num_tuple)
print(sum_tuple)

223

In [25]:
# Given a tuple, find the median value
import statistics as st
median_tuple = st.median(num_tuple)
print(median_tuple)

32

In [26]:
# Given a tuple, convert it to a list
tuple_list = list(num_tuple)
print(type(tuple_list))

<class 'list'>

In [27]:
# Given two tuples, concatenate them into a single tuple
age = (23,11,43,22)
gender = ('male','female')

# we can combine tuples with +

joined_tuple = age + gender
print(joined_tuple)

(23, 11, 43, 22, 'male', 'female')

In [28]:
# Given a tuple, reverse its order.
age = (23,11,43,22)
sorted_tuple = sorted(age,reverse=True)
print(sorted_tuple)

[43, 23, 22, 11]

In [29]:
# Given a tuple, check if it contains a specific element. We can use (in)
print(23 in age)

True

## Map Exercises
___
* Given a list of temperatures in Celsius, use the map() function to convert them to Fahrenheit.
* Given a list of strings, use the map() function to convert them to lowercase.
* Given a DataFrame of customer names, use the map() function to create a new column of initials.
* Given a DataFrame of product prices, use the map() function to apply a discount of 10% to each price.
* Given a list of numbers, use the map() function to round them to the nearest integer.
* Given a list of tuples, use the map() function to create a new list of the first elements of each tuple.
* Given a list of dictionary objects, use the map() function to create a new list of values for a specific key.
* Given a DataFrame of dates, use the map() function to create a new column of day of week.
* Given a list of strings, use the map() function to split each string into a list of words.
* Given a DataFrame of product descriptions, use the map() function to create a new column of word counts.

The map() function can be used to transform data in a DataFrame or Series.

In [30]:
# Given a list of temperatures in Celsius, use the map() function to convert them to Fahrenheit
import pandas as pd
temp = pd.DataFrame({'celcius':[23,45,12,33]})
temp['fahrenheit'] = temp['celcius'].map(lambda x: ((x*9/5)+35))
temp.head()

   celcius  fahrenheit
0       23        76.4
1       45       116.0
2       12        56.6
3       33        94.4

In [31]:
# Given a list of strings, use the map() function to convert them to lowercase.
name = ['APPLE','MANGO','ORANGE']
lower_name = map(lambda x: x.lower(), name)
# Let convert it to list to print the output out
convert_list = list(lower_name)
print(convert_list)

['apple', 'mango', 'orange']

In [32]:
# Given a DataFrame of customer names, use the map() function to create a new column of initials

# Let create a funtion that will take-in the first and last name, change it to upper case and return the initials 

def name_initials(name):
    names = name.upper()
    names = names.split(" ")
    return names[0][0] + "." + names[1][0]

In [33]:
# Let create the dataframe
import pandas as pd
customers_name = pd.DataFrame({'full_name':['babatunde Samuel','Ganiu Aina',
                                'Muhammadu Buhari', 'Bola Ahmed', 'Atiku Abubakar']})

In [34]:
customers_name['initials'] = customers_name['full_name'].map(name_initials)
customers_name

          full_name initials
0  babatunde Samuel      B.S
1        Ganiu Aina      G.A
2  Muhammadu Buhari      M.B
3        Bola Ahmed      B.A
4    Atiku Abubakar      A.A

In [35]:
# Given a DataFrame of product prices, use the map() function to apply a discount of 10% to each price
prices_data = pd.DataFrame({'total_price':[3400,22340,19000,12000]})
prices_data

   total_price
0         3400
1        22340
2        19000
3        12000

In [36]:
prices_data['discounted_price'] = prices_data['total_price'].map(lambda x: x*(10/100))
prices_data

   total_price  discounted_price
0         3400             340.0
1        22340            2234.0
2        19000            1900.0
3        12000            1200.0

In [37]:
# Given a list of numbers, use the map() function to round them to the nearest integer.
float_number = [22.3, 43.789, 19.33,24.545]
int_number = map(lambda x: int(x), float_number)
# Let convert it to list to print the output out
convert_list = list(int_number)
print(convert_list)

[22, 43, 19, 24]

In [38]:
# Given a list of tuples, use the map() function to create a new list of the first elements of each tuple.
tuple_list = ('Orange', 'Banana', 'Mango')

In [39]:
converted_tuple = list(map(lambda x: x[0], tuple_list))

In [40]:
converted_tuple

['O', 'B', 'M']

In [41]:
# Given a list of dictionary objects, use the map() function to create a new list of values for a specific key.
my_list = [{'a': 1, 'b': 2}, {'a': 3, 'b': 4}, {'a': 5, 'b': 6}]
new_list = list(map(lambda x: x['a'], my_list))

In [42]:
my_list = [{'a': 1, 'b': 2}, {'a': 3, 'b': 4}, {'a': 5, 'b': 6}]
new_list = list(map(lambda x: x['a'], my_list))

In [43]:
new_list

[1, 3, 5]

In [1]:
# Given a DataFrame of dates, use the map() function to create a new column of day of week.
import datetime
import pandas as pd
# Let create date range for the month of April
dates_range = pd.date_range(start='04/4/2018', end='04/30/2018')
april_dates = pd.DataFrame({'dates':dates_range})
#april_dates

In [45]:
# Let create a function to return day name
def day_week_name(dates):
    day = dates.strftime('%A')
    return day

In [46]:
#jj = april_dates.map(day_week_name)
april_dates['day_name'] = april_dates['dates'].map(day_week_name)

In [47]:
april_dates

        dates   day_name
0  2018-04-04  Wednesday
1  2018-04-05   Thursday
2  2018-04-06     Friday
3  2018-04-07   Saturday
4  2018-04-08     Sunday
5  2018-04-09     Monday
6  2018-04-10    Tuesday
7  2018-04-11  Wednesday
8  2018-04-12   Thursday
9  2018-04-13     Friday
10 2018-04-14   Saturday
11 2018-04-15     Sunday
12 2018-04-16     Monday
13 2018-04-17    Tuesday
14 2018-04-18  Wednesday
15 2018-04-19   Thursday
16 2018-04-20     Friday
17 2018-04-21   Saturday
18 2018-04-22     Sunday
19 2018-04-23     Monday
20 2018-04-24    Tuesday
21 2018-04-25  Wednesday
22 2018-04-26   Thursday
23 2018-04-27     Friday
24 2018-04-28   Saturday
25 2018-04-29     Sunday
26 2018-04-30     Monday

In [48]:
# Given a list of strings, use the map() function to split each string into a list of words.
words = ['Orange is good', 'Mango is great', 'Banana is ok']

In [49]:
list(map(lambda x: x.split(" "), words))

[['Orange', 'is', 'good'], ['Mango', 'is', 'great'], ['Banana', 'is', 'ok']]

In [50]:
# Given a DataFrame of product descriptions, use the map() function to create a new column of word counts
products_table = pd.DataFrame({'item':['Milo','Lux', 'Dano'],
                    'description':['Good chocollate tea', 'Nourishing bath soup', 'Good milk taste']})

In [51]:
products_table['desc_word_count'] = products_table['description'].map(lambda x: len(x))

In [52]:
products_table

   item           description  desc_word_count
0  Milo   Good chocollate tea               19
1   Lux  Nourishing bath soup               20
2  Dano       Good milk taste               15

**Reduce Exercises**

---


* Given a list of numbers, use the reduce() function to find the sum of the numbers.
* Given a list of strings, use the reduce() function to concatenate the strings.
* Given a list of tuples, use the reduce() function to find the product of the first elements.
* Given a list of numbers, use the reduce() function to find the maximum value.
* Given a list of strings, use the reduce() function to find the longest string.
* Given a list of tuples, use the reduce() function to find the minimum value of the second elements.
* Given a list of numbers, use the reduce() function to find the product of the numbers.
* Given a list of strings, use the reduce() function to find the total length of all the strings.
* Given a list of tuples, use the reduce() function to find the sum of the second elements where the first elements are even.
* Given a list of dictionaries, use the reduce() function to find the dictionary with the maximum value for a specific key.

**Reduce Function for Data Aggregation**

---


The reduce() function can be used to aggregate data in a DataFrame or Series.

In [53]:
import pandas as pd
from functools import reduce
import operator as op
# Let create function 
def my_add(a,b):
    results = a+b
    return results
list_num = [2,4,5,6]
list_reduce = reduce(my_add, list_num)
print(list_reduce)

17

In [54]:
# Given a list of strings, use the reduce() function to concatenate the strings.
list_string = ['O','l','a','y','i','n','k','a']
reduce(op.concat,list_string)

'Olayinka'

In [55]:
# Given a list of numbers, use the reduce() function to find the maximum value
list_num = [2,4,5,10,6]
reduce(max, list_num)

10

In [56]:
# Given a list of strings, use the reduce() function to find the longest string.
list_strings = ['cat','dog', 'monkey', 'fish']
strings_reduce = reduce(lambda x,y: max(x,y ,key=len), list_strings)

In [57]:
reduce(lambda x,y: max(x,y ,key=len), list_strings)

'monkey'

In [58]:
# Given a list of tuples, use the reduce() function to find the minimum value of the second elements
tuple_strings = ('apple', 'mango','banana','mango','pawpaw')
min_strings = reduce(lambda x,y: min(x,y[1], key=len),tuple_strings)
min_strings

'a'

In [59]:
# Given a list of numbers, use the reduce() function to find the product of the numbers.
list_product = [3,5,6,7,8]
product =reduce(lambda x,y: x*y,list_product)
product

5040

In [60]:
# Given a list of strings, use the reduce() function to find the total length of all the strings
list_strings = ['cat','dog', 'monkey', 'fish']
list_len = len(reduce(lambda x,y: x + y, list_strings))
list_len

16

In [61]:
# Given a list of tuples, use the reduce() function to find the sum of the second elements where the first elements are even.
list_tuple = ((1,2,3,4),(3,6,7,8),(8,3,2,1))

In [62]:
reduce(lambda x,y: x+y, list_tuple[1])

24

In [63]:
# Given a list of dictionaries, use the reduce() function to find the dictionary with the maximum value for a specific key.
data = [{'a': 3, 'b': 5}, {'a': 4, 'b': 6}, {'a': 8, 'b': 2},  {'a': 10, 'b': 2}]
key = 'a'
reduce(lambda x,y: x if x[key] > y[key] else y, data)

{'a': 10, 'b': 2}

**Filter Exercises**

---
* Given a list of numbers, use the filter() function to keep only the even numbers.
* Given a list of strings, use the filter() function to keep only the strings containing the letter 'a'.
* Given a list of dictionaries, use the filter() function to keep only the dictionaries where a specific key exists.
* Given a list of tuples, use the filter() function to keep only the tuples where the first element is greater than the second element.
* Given a list of numbers, use the filter() function to keep only the numbers greater than 10.
* Given a list of strings, use the filter() function to keep only the strings longer than 10 characters.
* Given a list of tuples, use the filter() function to keep only the tuples where both elements are positive.
* Given a list of dictionaries, use the filter() function to keep only the dictionaries where all keys have values.
* Given a list of strings, use the filter() function to keep only the strings that are palindromes.
* Given a list of numbers, use the filter() function to keep only the numbers that are perfect squares.

In [101]:
# Given a list of numbers, use the filter() function to keep only the even numbers
num_list = [3,4,58,21,57,6,33]
filter_even = filter(lambda x: x%2 == 0, num_list)
list(filter_even)

[4, 58, 6]

In [107]:
# Given a list of strings, use the filter() function to keep only the strings containing the letter 'a
string_list = ['dog','cat','cow','rat','pat']
list(filter(lambda x: 'a' in x, string_list))

['cat', 'rat', 'pat']

In [132]:
# Given a list of dictionaries, use the filter() function to keep only the dictionaries where a specific key exists.
my_dict = {'name': ['cat','alice'], 'surname': ['rice','beans'], 'food': ['cake','rake']}
key = 'a'
new_list = list(filter(lambda x: key in x, dict_list))
print(new_list)

['name', 'surname']

In [129]:
a = list(filter(lambda x: key in x, dict_list))

In [130]:
a

['name', 'surname']